In [1]:
import pandas as pd
import numpy as np

In [2]:
#Example Dataframe
df=pd.DataFrame({
    'a':[1,2,3],
    'b':[4,5,6],
    'c':[7,8,9]
})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [35]:
#practice dataframe

df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

In [36]:
df

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [38]:
df.index=['Ca','Fr','Ge','It','Ja','UK','US']
df

    Population       GDP  Surface Area    HDI Continent
Ca      35.467   1785387       9984670  0.913   America
Fr      63.951   2833687        640679  0.888    Europe
Ge      80.940   3874437        357114  0.916    Europe
It      60.665   2167744        301336  0.873    Europe
Ja     127.061   4602367        377930  0.891      Asia
UK      64.511   2950039        242495  0.907    Europe
US     318.523  17348075       9525067  0.915   America

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Ca to US
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [16]:
df.size

35

In [17]:
df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [20]:
df.dtypes

Population      float64
GDP               int64
Surface Area      int64
HDI             float64
Continent        object
dtype: object

In [22]:
df.dtypes.value_counts()

float64    2
int64      2
object     1
dtype: int64

# Indexing Rows
# loc
# iloc

In [24]:
#loc is used to select using index 
df.loc['Ca']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Ca, dtype: object

In [26]:
#iloc is used to select through sequential number of index 
df.iloc[3]

Population       60.665
GDP             2167744
Surface Area     301336
HDI               0.873
Continent        Europe
Name: It, dtype: object

# Indexing Columns

In [31]:
df['GDP']

Ca     1785387
Fr     2833687
Ge     3874437
It     2167744
Ja     4602367
UK     2950039
US    17348075
Name: GDP, dtype: int64

# Indexing similar to Pandas Series

In [32]:
df.loc['It':'UK']

    Population      GDP  Surface Area    HDI Continent
It      60.665  2167744        301336  0.873    Europe
Ja     127.061  4602367        377930  0.891      Asia
UK      64.511  2950039        242495  0.907    Europe

In [35]:
df.iloc[1:3]

    Population      GDP  Surface Area    HDI Continent
Fr      63.951  2833687        640679  0.888    Europe
Ge      80.940  3874437        357114  0.916    Europe

In [36]:
# Selecting a range of rows and particular column
df.loc['Ge':'UK','Continent']

Ge    Europe
It    Europe
Ja      Asia
UK    Europe
Name: Continent, dtype: object

In [37]:
df.loc['Ge':'UK',['Continent','GDP']]

   Continent      GDP
Ge    Europe  3874437
It    Europe  2167744
Ja      Asia  4602367
UK    Europe  2950039

In [38]:
df.iloc[1:4,2]

Fr    640679
Ge    357114
It    301336
Name: Surface Area, dtype: int64

In [40]:
df.iloc[1:4,[1,3]]

        GDP    HDI
Fr  2833687  0.888
Ge  3874437  0.916
It  2167744  0.873

In [5]:
a=np.array([1,2,3])

In [6]:
a

array([1, 2, 3])

In [7]:
a

array([1, 2, 3])

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [13]:
df['d'] = round(
    df['b'] /
    df['a'],3
)

In [14]:
df

   a  b  c    d
0  1  4  7  4.0
1  2  5  8  2.5
2  3  6  9  2.0

In [16]:
s = pd.Series(['a', 3, np.nan, 1, np.nan])

s

0      a
1      3
2    NaN
3      1
4    NaN
dtype: object

In [21]:
print(s.notnull().sum())

3

In [39]:
df[df['Continent'].unique(),'Continent'].count()

InvalidIndexError: (array(['America', 'Europe', 'Asia'], dtype=object), 'Continent')